package com.test02.day02;

/**
 * @author 歪歪欧巴
 * @Description: TODO
 * @date 2020/4/27 20:02
 * @Copyright:湖南省零檬信息技术有限公司. All rights reserved.
 */
public class HomeWork {
    public static void main(String[] args) {
        //第一节课的作业
       /*> 创建一维数组
        - 请使用两种语法创建数组，数组的元素为{“我”,”是”,”最”,”棒”,”的”}
        */
        //1、创建数组-数据进行了初始化
        /*String[] arr1 ={"我","是","最","棒","的"};
        //2、创建数组-没有对数据进行初始化
         */
        /*String[] arr2 = new String[5];
        arr2[0] = "我";
        arr2[1] = "是";
        arr2[2] = "最";
        arr2[3] = "棒";
        arr2[4] = "的";
        */


        //- 请使用两种语法创建数组，数组的元素为{100,200,300,400,500}
        /*int[] arr1 ={100,200,300,400,500};
        //2、创建数组-没有对数据进行初始化
        int[] arr2 = new String[5];
        arr2[0] = 100;
        arr2[1] = 200;
        arr2[2] = 300;
        arr2[3] = 400;
        arr2[4] = 500;*/

        /*
        > 创建二维数组
        - 请使用两种语法来创建数组，数组的元素为{{“第一个”,”二维”},{“数”,”组”}}
        */
        //数组的规则！！！在赋值之前数组的容量一定要是固定的
        //1、创建数组-数据进行初始化
        /*String[][] arr1 = {{"第一个","二维"},{"数","组"}};
        //2、创建数组-没有对数据进行初始化
        String[][] arr2 = new String[2][2];
        //在每一行（一维数组）来去创建
        arr2[0] = new String[2];
        arr2[0][0] = "第一个";
        arr2[0][1] = "二维";
        arr2[1] = new String[2];
        arr2[1][0] = "数";
        arr2[1][1] = "组";*/
        // 请使用两种语法来创建数组，数组的元素为{{“第”,”二”},{“个”,”二”},{“维”,”数”,”组”}}
        /*String[][] arr2 = new String[3][];
        //创建二维数组的第一行数据
        arr2[0] = new String[2];
        arr2[0][0] = "第";
        arr2[0][1] = "二";
        //创建二维数组的第二行数据
        arr2[1] = new String[2];
        arr2[1][0] = "个";
        arr2[1][1] = "二";
        //创建二维数组的第三行数据
        arr2[2] = new String[3];
        arr2[2][0] = "维";
        arr2[2][1] = "数";
        arr2[2][2] = "组";*/
        // 请使用两种语法来创建数组，数组的元素为{{10,20},{30,40}}
        // 请使用两种语法来创建数组，数组的元素为{{50,60},{70,80},{90,100,110}}


        //第二节课的作业
        int x = 1;int y = 2;int z = 3;
        System.out.print(x+(--z));
        /*求：x/y
        求：y/x
        求：x%y
        求：y%x
        求：(++x)+y
        求：x+(y++)
        求：x+(--z)
        */

    }
}
