"""
======================
Author: 柠檬班-小简
Time: 2021/12/22 21:54
Project: py47-编码技术
Company: 湖南零檬信息技术有限公司
======================
"""
"""
面试题：
    列表/字典/元组有什么区别？

表达形式：
    []  有序的，索引。值可以是任意类型，可以重复。
    {}  无序的，key-value形式的。key是唯一的，value可以是任意类型。
    ()  有序的，索引。只读。

列表和字典：可变类型。
元组：不可变类型。

应用场景：
    列表：存储多个同一类型的数据。
    字典：多方面描述一个事物。
    元组：在程序当中，有1个以上的数据定义之后，只读取不修改。
    
    举例你自动化项目或者框架当中的处理场景。
    举例主流自动化第三方库当中的应用场景。    
"""

# 预习：if判断，while循环，for循环
# https://www.runoob.com/python3/python3-conditional-statements.html