"""
======================
Author: 柠檬班-小简
Time: 2021/12/31 20:07
Project: py47-编码技术
Company: 湖南零檬信息技术有限公司
======================
"""
"""
1、一个足球队在寻找年龄在10-12岁的小女孩（包括10岁和12岁）加入，编写一个程序，
1.1 询问用户的性别（m表示男性，f表示女性）和年龄，
1.2 然后显示一条消息指出这个人是否可以加入球队，询问10次后，输出满足条件的总人数。
"""

# count = 0
#
# for i in range(10):
#     sex = input("用户的性别(（m表示男性，f表示女性）)：")
#     age = input("用户的年龄：")
#
#     if sex == "f" and age in ["11", "12", "10"]:
#         print("恭喜，可以加入足球队！")
#         count += 1
#     else:
#         print("很抱歉，不能够加入足球队！")
#
# print(f"询问10次后，满足球队的人数为：{count}")

"""
2、输出99乘法表(双重for循环)
格式如下：（每项数据之间空一个Tab键，可以使用"\t"）
1 * 1 = 1
1 * 2 = 2 2 * 2 = 4
1 * 3 = 3 2 * 3 = 6 3 * 3 = 9
1 * 4 = 4 2 * 4 = 8 3 * 4 = 12 4 * 4 = 16
1 * 5 = 5 2 * 5 = 10 3 * 5 = 15 4 * 5 = 20 5 * 5 = 25
1 * 6 = 6 2 * 6 = 12 3 * 6 = 18 4 * 6 = 24 5 * 6 = 30 6 * 6 = 36
1 * 7 = 7 2 * 7 = 14 3 * 7 = 21 4 * 7 = 28 5 * 7 = 35 6 * 7 = 42 7 * 7 = 49
1 * 8 = 8 2 * 8 = 16 3 * 8 = 24 4 * 8 = 32 5 * 8 = 40 6 * 8 = 48 7 * 8 = 56 8 * 8 = 64
1 * 9 = 9 2 * 9 = 18 3 * 9 = 27 4 * 9 = 36 5 * 9 = 45 6 * 9 = 54 7 * 9 = 63 8 * 9 = 72 9 * 9 = 81

row=1  
 1 * row
row = 2
 1 * row  2 * row 
"""
# row = 7
# for item in range(1, row+1):
#     print(f"{item} * {row} = {item*row}",end="\t")

for row in range(1,10):
    for item in range(1, row + 1):
        print(f"{item} * {row} = {item * row}", end="\t")
    print()